Repository: Mangor1no/preview-shinobi-war
Catalog: app/locales/*/messages.po
Languages: ja, km, th

source: © {0} 32BITZ COMPANY LIMITED. All rights reserved.
ja: © {0} 32BITZ COMPANY LIMITED. 全著作権所有。
km: © {0} 32BITZ COMPANY LIMITED. រក្សាសិទ្ធិទាំងអស់។
th: © {0} 32BITZ COMPANY LIMITED. สงวนลิขสิทธิ์

source: 1. Acceptance of Terms
ja: 1. 利用規約の承認
km: 1. ការទទួលយកលក្ខខណ្ឌ
th: 1. การยอมรับข้อกำหนด

source: 1. Introduction
ja: 1. はじめに
km: 1. សេចក្តីផ្តើម
th: 1. บทนำ

source: 10. Updates & Modifications
ja: 10. 更新と変更
km: 10. ការអាប់ដេត និងការកែប្រែ
th: 10. การอัปเดตและการแก้ไข

source: 11. International Data Transfers
ja: 11. 国際的なデータ転送
km: 11. ការផ្ទេរទិន្នន័យអន្តរជាតិ
th: 11. การถ่ายโอนข้อมูลระหว่างประเทศ

source: 11. Termination
ja: 11. 終了
km: 11. ការបញ្ចប់
th: 11. การสิ้นสุด

source: 12. Disclaimer of Warranties
ja: 12. 保証の免責
km: 12. ការបដិសេធការធានា
th: 12. การปฏิเสธการรับประกัน

source: 12. Your Rights
ja: 12. お客様の権利
km: 12. សិទ្ធិរបស់អ្នក
th: 12. สิทธิของคุณ

source: 13. Changes to This Policy
ja: 13. 本ポリシーの変更
km: 13. ការផ្លាស់ប្តូរនយោបាយនេះ
th: 13. การเปลี่ยนแปลงนโยบายนี้

source: 13. Limitation of Liability
ja: 13. 責任の制限
km: 13. ការកំណត់កំហិតនៃការទទួលខុសត្រូវ
th: 13. การจำกัดความรับผิดชอบ

source: 14. Contact Information
ja: 14. 連絡先情報
km: 14. ព័ត៌មានទំនាក់ទំនង
th: 14. ข้อมูลติดต่อ

source: 14. Governing Law
ja: 14. 準拠法
km: 14. ច្បាប់ដែលគ្រប់គ្រង
th: 14. กฎหมายที่ใช้บังคับ

source: 15. Contact
ja: 15. お問い合わせ
km: 15. ទំនាក់ទំនង
th: 15. ติดต่อ

source: 2. Developer & Ownership
ja: 2. 開発者と所有権
km: 2. អ្នកអភិវឌ្ឍន៍ និងកម្មសិទ្ធិ
th: 2. นักพัฒนาและกรรมสิทธิ์

source: 2. Information We Collect
ja: 2. 収集する情報
km: 2. ព័ត៌មានដែលយើងប្រមូល
th: 2. ข้อมูลที่เรารวบรวม

source: 3. Eligibility & Legal Capacity
ja: 3. 適格性と法的能力
km: 3. សមត្ថភាព និងសមត្ថភាពផ្លូវច្បាប់
th: 3. คุณสมบัติและความสามารถทางกฎหมาย

source: 3. Information We Do NOT Collect
ja: 3. 収集しない情報
km: 3. ព័ត៌មានដែលយើងមិនប្រមូល
th: 3. ข้อมูลที่เราไม่รวบรวม

source: 4. How We Use Your Data
ja: 4. データの使用方法
km: 4. របៀបដែលយើងប្រើប្រាស់ទិន្នន័យរបស់អ្នក
th: 4. วิธีที่เราใช้ข้อมูลของคุณ

source: 4. User Accounts
ja: 4. ユーザーアカウント
km: 4. គណនីអ្នកប្រើប្រាស់
th: 4. บัญชีผู้ใช้

source: 5. Legal Basis for Processing
ja: 5. 処理の法的根拠
km: 5. មូលដ្ឋានផ្លូវច្បាប់សម្រាប់ការដំណើរការ
th: 5. พื้นฐานทางกฎหมายสำหรับการประมวลผล

source: 5. License Grant & Restrictions
ja: 5. ライセンスの付与と制限
km: 5. ការផ្តល់អាជ្ញាប័ណ្ណ និងការកំណត់កំហិត
th: 5. การให้สิทธิ์และข้อจำกัด

source: 6. Data Sharing & Third Parties
ja: 6. データ共有と第三者
km: 6. ការចែករំលែកទិន្នន័យ និងភាគីទីបី
th: 6. การแบ่งปันข้อมูลและบุคคลที่สาม

source: 6. Virtual Currency & Items
ja: 6. 仮想通貨とアイテム
km: 6. រូបិយប័ណ្ណផ្លូវការ និងធាតុ
th: 6. สกุลเงินเสมือนและไอเทม

source: 7. Data Retention
ja: 7. データの保持
km: 7. ការរក្សាទុកទិន្នន័យ
th: 7. การเก็บรักษาข้อมูล

source: 7. Events & Limited-Time Content
ja: 7. イベントと期間限定コンテンツ
km: 7. ព្រឹត្តិការណ៍ និងមាតិកាពេលវេលាកំណត់
th: 7. กิจกรรมและเนื้อหาจำกัดเวลา

source: 8:00 AM - 6:00 PM, every day (GMT +0)
ja: 毎日 8:00 - 18:00 (GMT +0)
km: រៀងរាល់ថ្ងៃ 8:00 - 18:00 (GMT +0)
th: ทุกวัน 8:00 - 18:00 (GMT +0)

source: 8. Data Security
ja: 8. データセキュリティ
km: 8. សុវត្ថិភាពទិន្នន័យ
th: 8. ความปลอดภัยของข้อมูล

source: 8. User Conduct
ja: 8. ユーザーの行動
km: 8. ឥរិយាបថអ្នកប្រើប្រាស់
th: 8. พฤติกรรมผู้ใช้

source: 9. Account Termination & Data Deletion
ja: 9. アカウントの終了とデータの削除
km: 9. ការបញ្ចប់គណនី និងការលុបទិន្នន័យ
th: 9. การสิ้นสุดบัญชีและการลบข้อมูล

source: 9. Data, Progress & Loss
ja: 9. データ、進捗、損失
km: 9. ទិន្នន័យ ការវិវត្ត និងការបាត់បង់
th: 9. ข้อมูล ความคืบหน้า และการสูญเสีย

source: Access your personal data
ja: 個人データへのアクセス
km: ចូលប្រើប្រាស់ទិន្នន័យផ្ទាល់ខ្លួនរបស់អ្នក
th: เข้าถึงข้อมูลส่วนบุคคลของคุณ

source: Account data may be deleted upon termination or inactivity
ja: アカウントデータは終了時または非アクティブ時に削除される場合があります
km: ទិន្នន័យគណនីអាចត្រូវបានលុបនៅពេលបញ្ចប់ ឬមិនសកម្ម
th: ข้อมูลบัญชีอาจถูกลบเมื่อสิ้นสุดหรือไม่ใช้งาน

source: Account identifiers (username, user ID)
ja: アカウント識別子（ユーザー名、ユーザーID）
km: អត្តសញ្ញាណគណនី (ឈ្មោះអ្នកប្រើប្រាស់, ID អ្នកប្រើប្រាស់)
th: ตัวระบุบัญชี (ชื่อผู้ใช้, ID ผู้ใช้)

source: Account sharing, selling, or transferring is strictly prohibited.
ja: アカウントの共有、販売、または譲渡は厳禁です。
km: ការចែករំលែក លក់ ឬផ្ទេរគណនីត្រូវបានហាមឃាត់យ៉ាងតឹងរ៉ឹង។
th: การแชร์ ขาย หรือโอนบัญชีถูกห้ามอย่างเคร่งครัด

source: Accounts may be terminated at our sole discretion.
ja: アカウントは当社の裁量で終了される場合があります。
km: គណនីអាចត្រូវបានបញ្ចប់តាមការសម្របសម្រួលរបស់យើងតែមួយគត់។
th: บัญชีอาจถูกยกเลิกตามดุลยพินิจของเราเท่านั้น

source: All virtual currency, items, characters, and rewards remain the sole property of 32BitZ Studio and have no real-world value.
ja: すべての仮想通貨、アイテム、キャラクター、報酬は32BitZ Studioの専有財産であり、現実世界での価値はありません。
km: រូបិយប័ណ្ណផ្លូវការ ធាតុ តួអក្សរ និងរង្វាន់ទាំងអស់នៅតែជាកម្មសិទ្ធិរបស់ 32BitZ Studio ហើយគ្មានតម្លៃពិតប្រាកដ។
th: สกุลเงินเสมือน ไอเทม ตัวละคร และรางวัลทั้งหมดยังคงเป็นทรัพย์สินของ 32BitZ Studio และไม่มีมูลค่าในโลกจริง

source: Analytics and crash reporting
ja: 分析とクラッシュレポート
km: ការវិភាគ និងការរាយការណ៍ការបរាជ័យ
th: การวิเคราะห์และการรายงานข้อผิดพลาด

source: Attempts to disrupt servers will result in permanent bans.
ja: サーバーを妨害する試みは永久BANの対象となります。
km: ការព្យាយាមបំផ្លាញម៉ាស៊ីនមេនឹងនាំឱ្យមានការហាមឃាត់ជាអចិន្ត្រៃយ៍។
th: ความพยายามที่จะรบกวนเซิร์ฟเวอร์จะส่งผลให้ถูกแบนถาวร

source: Back to Home
ja: ホームに戻る
km: ត្រលប់ទៅផ្ទះ
th: กลับหน้าแรก

source: Back to News
ja: ニュースに戻る
km: ត្រលប់ទៅព័ត៌មាន
th: กลับไปที่ข่าว

source: Balances may be adjusted for balancing or security reasons.
ja: バランス調整またはセキュリティ上の理由により、残高が調整される場合があります。
km: សមតុល្យអាចត្រូវបានកែតម្រូវសម្រាប់ហេតុផលសមតុល្យ ឬសុវត្ថិភាព។
th: ยอดเงินอาจถูกปรับเพื่อความสมดุลหรือเหตุผลด้านความปลอดภัย

source: Bank account or credit card numbers (handled by third parties)
ja: 銀行口座またはクレジットカード番号（第三者により処理）
km: លេខគណនីធនាគារ ឬកាតឥណទាន (ដែលគ្រប់គ្រងដោយភាគីទីបី)
th: หมายเลขบัญชีธนาคารหรือบัตรเครดิต (จัดการโดยบุคคลที่สาม)

source: Biometric or sensitive personal data
ja: 生体認証または機密個人データ
km: ទិន្នន័យជីវមាត្រ ឬទិន្នន័យផ្ទាល់ខ្លួនដែលពាក់ព័ន្ធ
th: ข้อมูลชีวภาพหรือข้อมูลส่วนบุคคลที่ละเอียดอ่อน

source: By accessing, installing, downloading, registering, or playing <0> Shinobi War </0> (the “Game”), you acknowledge that you have read, understood, and agree to be legally bound by these Terms & Conditions (“Terms”). If you do not agree to these Terms, you must immediately discontinue all use of the Game.
ja: <0> Shinobi War </0>（「ゲーム」）にアクセス、インストール、ダウンロード、登録、またはプレイすることにより、お客様はこれらの利用規約（「規約」）を読み、理解し、法的に拘束されることに同意したことを認めます。これらの規約に同意しない場合は、ゲームの使用を直ちに中止する必要があります。
km: ដោយការចូលប្រើប្រាស់ ដំឡើង ទាញយក ចុះឈ្មោះ ឬលេង<0> Shinobi War </0> ("ហ្គេម") អ្នកទទួលស្គាល់ថាអ្នកបានអាន យល់ និងយល់ព្រមឱ្យចងភ្ជាប់តាមផ្លូវច្បាប់ដោយលក្ខខណ្ឌ និងលក្ខខណ្ឌទាំងនេះ ("លក្ខខណ្ឌ")។ ប្រសិនបើអ្នកមិនយល់ព្រមនឹងលក្ខខណ្ឌទាំងនេះទេ អ្នកត្រូវតែបញ្ឈប់ការប្រើប្រាស់ហ្គេមទាំងអស់ភ្លាមៗ។
th: โดยการเข้าถึง ติดตั้ง ดาวน์โหลด ลงทะเบียน หรือเล่น<0> Shinobi War </0> ("เกม") คุณยอมรับว่าคุณได้อ่าน เข้าใจ และยินยอมที่จะผูกพันตามกฎหมายโดยข้อกำหนดและเงื่อนไขเหล่านี้ ("ข้อกำหนด") หากคุณไม่เห็นด้วยกับข้อกำหนดเหล่านี้ คุณต้องหยุดใช้เกมทันที

source: Cheats, bots, exploits, or automation tools are forbidden.
ja: チート、ボット、エクスプロイト、または自動化ツールは禁止されています。
km: ការកុហក បូត ការប្រើប្រាស់ ឬឧបករណ៍ស្វ័យប្រវត្តិត្រូវបានហាមឃាត់។
th: การโกง บอท การใช้ประโยชน์ หรือเครื่องมืออัตโนมัติถูกห้าม

source: class system
ja: クラスシステム
km: ប្រព័ន្ធថ្នាក់
th: ระบบคลาส

source: Cloud hosting and server infrastructure
ja: クラウドホスティングとサーバーインフラ
km: ការផ្តល់ជូនពីពពក និងហេដ្ឋារចនាសម្ព័ន្ធម៉ាស៊ីនមេ
th: การโฮสต์บนคลาวด์และโครงสร้างพื้นฐานของเซิร์ฟเวอร์

source: Comply with legal obligations
ja: 法的義務の遵守
km: អនុវត្តតាមកាតព្វកិច្ចផ្លូវច្បាប់
th: ปฏิบัติตามภาระผูกพันทางกฎหมาย

source: Customer Support
ja: カスタマーサポート
km: ការគាំទ្រអតិថិជន
th: ฝ่ายสนับสนุนลูกค้า

source: Deleted data may not be recoverable
ja: 削除されたデータは回復できない場合があります
km: ទិន្នន័យដែលបានលុបអាចមិនអាចស្តារឡើងវិញបាន
th: ข้อมูลที่ถูกลบอาจไม่สามารถกู้คืนได้

source: Depending on your jurisdiction, you may have the right to:
ja: お客様の管轄区域によっては、以下の権利がある場合があります：
km: អាស្រ័យលើអំណាចរបស់អ្នក អ្នកអាចមានសិទ្ធិ:
th: ขึ้นอยู่กับเขตอำนาจของคุณ คุณอาจมีสิทธิ์:

source: Detect cheating, fraud, or abuse
ja: チート、詐欺、または不正使用の検出
km: ការរកឃើញការកុហក ការបោកបញ្ចោត ឬការរំលោភបំពាន
th: ตรวจจับการโกง การฉ้อโกง หรือการละเมิด

source: Device and technical data (IP address, device type, OS)
ja: デバイスおよび技術データ（IPアドレス、デバイスタイプ、OS）
km: ទិន្នន័យឧបករណ៍ និងបច្ចេកទេស (អាសយដ្ឋាន IP ប្រភេទឧបករណ៍ OS)
th: ข้อมูลอุปกรณ์และเทคนิค (ที่อยู่ IP ประเภทอุปกรณ์ ระบบปฏิบัติการ)

source: DOWNLOAD
ja: ダウンロード
km: ទាញយក
th: ดาวน์โหลด

source: Download & Install
ja: ダウンロードとインストール
km: ទាញយក និងដំឡើង
th: ดาวน์โหลดและติดตั้ง

source: Each user may create only one account unless expressly permitted.
ja: 明示的に許可されない限り、各ユーザーは1つのアカウントのみ作成できます。
km: អ្នកប្រើប្រាស់នីមួយៗអាចបង្កើតគណនីតែមួយប៉ុណ្ណោះ លើកលែងតែមានការអនុញ្ញាតយ៉ាងច្បាស់។
th: ผู้ใช้แต่ละคนสามารถสร้างบัญชีได้เพียงบัญชีเดียวเว้นแต่จะได้รับอนุญาตอย่างชัดเจน

source: Email
ja: メール
km: អ៊ីមែល
th: อีเมล

source: Email:
ja: メール：
km: អ៊ីមែល:
th: อีเมล:

source: Event content is temporary and may be removed at any time.
ja: イベントコンテンツは一時的なものであり、いつでも削除される場合があります。
km: មាតិកាព្រឹត្តិការណ៍គឺបណ្តោះអាសន្ន និងអាចត្រូវបានដកចេញនៅពេលណាក៏បាន។
th: เนื้อหาของกิจกรรมเป็นแบบชั่วคราวและอาจถูกลบได้ตลอดเวลา

source: Event rules may change without notice.
ja: イベントルールは予告なく変更される場合があります。
km: ច្បាប់ព្រឹត្តិការណ៍អាចផ្លាស់ប្តូរដោយមិនចាំបាច់ជូនដំណឹង។
th: กฎของกิจกรรมอาจเปลี่ยนแปลงโดยไม่ต้องแจ้งให้ทราบ

source: Exploiting bugs must be reported immediately.
ja: バグの悪用は直ちに報告する必要があります。
km: ការប្រើប្រាស់កំហុសត្រូវតែរាយការណ៍ភ្លាមៗ។
th: การใช้ประโยชน์จากข้อผิดพลาดต้องรายงานทันที

source: FANPAGE
ja: ファンページ
km: ទំព័រអ្នកគាំទ្រ
th: แฟนเพจ

source: For legal inquiries, contact:
ja: 法的な問い合わせについては、以下にお問い合わせください：
km: សម្រាប់ការសួរផ្លូវច្បាប់ សូមទំនាក់ទំនង:
th: สำหรับคำถามทางกฎหมาย ติดต่อ:

source: Gameplay data (progress, stats, achievements, logs)
ja: ゲームプレイデータ（進捗、統計、実績、ログ）
km: ទិន្នន័យការលេង (ការវិវត្ត ស្ថិតិ ការសម្រេចបាន កំណត់ត្រា)
th: ข้อมูลการเล่นเกม (ความคืบหน้า สถิติ ความสำเร็จ บันทึก)

source: GROUP
ja: グループ
km: ក្រុម
th: กลุ่ม

source: GUIDE
ja: ガイド
km: មគ្គុទេសក៍
th: คู่มือ

source: guides
ja: ガイド
km: មគ្គុទេសក៍
th: คู่มือ

source: Harassment, hate speech, or abusive behavior is prohibited.
ja: ハラスメント、ヘイトスピーチ、または虐待的な行動は禁止されています。
km: ការរំលោភបំពាន ការនិយាយស្អប់ខពួក ឬឥរិយាបថរំលោភបំពានត្រូវបានហាមឃាត់។
th: การล่วงละเมิด คำพูดแสดงความเกลียดชัง หรือพฤติกรรมที่ละเมิดถูกห้าม

source: highlights
ja: ハイライト
km: ចំណុចសំខាន់
th: ไฮไลท์

source: HOME
ja: ホーム
km: ទំព័រដើម
th: หน้าแรก

source: If you have questions regarding this Privacy Policy, contact:
ja: このプライバシーポリシーに関するご質問がある場合は、以下にお問い合わせください：
km: ប្រសិនបើអ្នកមានសំណួរទាក់ទងនឹងនយោបាយភាពឯកជននេះ សូមទំនាក់ទំនង:
th: หากคุณมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวนี้ ติดต่อ:

source: Improve gameplay balance and performance
ja: ゲームプレイのバランスとパフォーマンスの向上
km: កែលម្អសមតុល្យ និងការអនុវត្តការលេង
th: ปรับปรุงความสมดุลและประสิทธิภาพการเล่นเกม

source: Join the ultimate ninja warfare. Choose your class, master your weapons, and dominate the battlefield.
ja: 究極の忍者戦争に参加しましょう。クラスを選択し、武器をマスターし、戦場を支配してください。
km: ចូលរួមការប្រយុទ្ធនិន្ជានុប្បវត្តិដ៏អស្ចារ្យ។ ជ្រើសរើសថ្នាក់របស់អ្នក ស្ទាត់អាវុធរបស់អ្នក និងគ្រប់គ្រងពិភពលោក។
th: เข้าร่วมสงครามนินจาอันยิ่งใหญ่ เลือกคลาสของคุณ เชี่ยวชาญอาวุธของคุณ และครองสนามรบ

source: Last updated: {0}
ja: 最終更新：{0}
km: អាប់ដេតចុងក្រោយ: {0}
th: อัปเดตล่าสุด: {0}

source: Legal obligations
ja: 法的義務
km: កាតព្វកិច្ចផ្លូវច្បាប់
th: ภาระผูกพันทางกฎหมาย

source: Legitimate interests (security, analytics, fraud prevention)
ja: 正当な利益（セキュリティ、分析、不正防止）
km: ផលប្រយោជន៍ត្រឹមត្រូវ (សុវត្ថិភាព ការវិភាគ ការការពារការបោកបញ្ចោត)
th: ผลประโยชน์ที่ชอบด้วยกฎหมาย (ความปลอดภัย การวิเคราะห์ การป้องกันการฉ้อโกง)

source: More Information
ja: 詳細情報
km: ព័ត៌មានបន្ថែម
th: ข้อมูลเพิ่มเติม

source: news
ja: ニュース
km: ព័ត៌មាន
th: ข่าว

source: News
ja: ニュース
km: ព័ត៌មាន
th: ข่าว

source: NEWS
ja: ニュース
km: ព័ត៌មាន
th: ข่าว

source: No compensation will be provided for terminated accounts.
ja: 終了されたアカウントには補償は提供されません。
km: នឹងមិនមានការប indemnity សម្រាប់គណនីដែលបានបញ្ចប់ទេ។
th: จะไม่มีการชดเชยสำหรับบัญชีที่ถูกยกเลิก

source: No news available
ja: ニュースがありません
km: គ្មានព័ត៌មាន
th: ไม่มีข่าว

source: No refunds for lost or modified virtual items.
ja: 紛失または変更された仮想アイテムの返金はありません。
km: មិនមានការសងប្រាក់សម្រាប់ធាតុផ្លូវការដែលបាត់បង់ ឬបានកែប្រែទេ។
th: ไม่มีการคืนเงินสำหรับไอเทมเสมือนที่สูญหายหรือถูกแก้ไข

source: Object to certain processing activities
ja: 特定の処理活動への異議申し立て
km: ប្រឆាំងនឹងសកម្មភាពដំណើរការមួយចំនួន
th: คัดค้านกิจกรรมการประมวลผลบางอย่าง

source: Operate and maintain the Game
ja: ゲームの運営と保守
km: ដំណើរការ និងថែទាំហ្គេម
th: ดำเนินการและบำรุงรักษาเกม

source: Payment processors (transaction references only)
ja: 決済プロセッサー（取引参照のみ）
km: អ្នកដំណើរការការទូទាត់ (មានតែការយោងប្រតិបត្តិការ)
th: ผู้ประมวลผลการชำระเงิน (เฉพาะการอ้างอิงธุรกรรม)

source: Performance of a contract (providing the Game)
ja: 契約の履行（ゲームの提供）
km: ការអនុវត្តកិច្ចសន្យា (ការផ្តល់ហ្គេម)
th: การปฏิบัติตามสัญญา (การให้บริการเกม)

source: Privacy Policy
ja: プライバシーポリシー
km: នយោបាយភាពឯកជន
th: นโยบายความเป็นส่วนตัว

source: Provide customer support
ja: カスタマーサポートの提供
km: ផ្តល់ការគាំទ្រអតិថិជន
th: ให้การสนับสนุนลูกค้า

source: Purchase and transaction metadata (non-payment credentials)
ja: 購入および取引メタデータ（非決済認証情報）
km: ទិន្នន័យមេតាទិន្នន័យនៃការទិញ និងប្រតិបត្តិការ (លិខិតសម្គាល់មិនមែនការទូទាត់)
th: ข้อมูลเมตาของการซื้อและการทำธุรกรรม (ข้อมูลประจำตัวที่ไม่ใช่การชำระเงิน)

source: Read More
ja: 続きを読む
km: អានបន្ថែម
th: อ่านเพิ่มเติม

source: Real-world identity documents
ja: 実世界の身分証明書
km: ឯកសារអត្តសញ្ញាណពិតប្រាកដ
th: เอกสารแสดงตัวตนในโลกจริง

source: Request correction or deletion
ja: 訂正または削除の要求
km: ស្នើសុំកែប្រែ ឬលុប
th: ขอแก้ไขหรือลบ

source: Reverse engineering or data mining is prohibited.
ja: リバースエンジニアリングまたはデータマイニングは禁止されています。
km: ការវិស្វកម្មបញ្ច្រាស់ ឬការជីកយកទិន្នន័យត្រូវបានហាមឃាត់។
th: การวิศวกรรมย้อนกลับหรือการทำเหมืองข้อมูลถูกห้าม

source: Rewards not claimed within event periods are forfeited.
ja: イベント期間内に受け取らなかった報酬は没収されます。
km: រង្វាន់ដែលមិនបានទាមទារក្នុងរយៈពេលព្រឹត្តិការណ៍នឹងត្រូវបានបាត់បង់។
th: รางวัลที่ไม่ได้รับภายในช่วงเวลาของกิจกรรมจะถูกยกเลิก

source: Shinobi War - Developed by 32BitZ Studio
ja: Shinobi War - 32BitZ Studio開発
km: Shinobi War - អភិវឌ្ឍដោយ 32BitZ Studio
th: Shinobi War - พัฒนาโดย 32BitZ Studio

source: Shinobi War - Epic Ninja Battle Game
ja: Shinobi War - 壮大な忍者バトルゲーム
km: សង្គ្រាម Shinobi - ហ្គេមប្រយុទ្ធនិន្ជានុប្បវត្តិដ៏អស្ចារ្យ
th: Shinobi War - เกมต่อสู้นินจาอันยิ่งใหญ่

source: Shinobi War is developed, owned, and operated by<0> 32BitZ Studio </0> (“we”, “us”, “our”). All rights not expressly granted to you are reserved by 32BitZ Studio.
ja: Shinobi Warは<0> 32BitZ Studio </0>（「当社」「私たち」「当社の」）によって開発、所有、運営されています。明示的に付与されていないすべての権利は32BitZ Studioに留保されます。
km: Shinobi War ត្រូវបានអភិវឌ្ឍន៍ មានកម្មសិទ្ធិ និងដំណើរការដោយ<0> 32BitZ Studio </0> ("យើង", "ពួកយើង", "របស់យើង")។ សិទ្ធិទាំងអស់ដែលមិនត្រូវបានផ្តល់ឱ្យអ្នកយ៉ាងច្បាស់ត្រូវបានរក្សាទុកដោយ 32BitZ Studio។
th: Shinobi War ได้รับการพัฒนา ครอบครอง และดำเนินการโดย<0> 32BitZ Studio </0> ("เรา", "พวกเรา", "ของเรา") สิทธิ์ทั้งหมดที่ไม่ได้มอบให้คุณอย่างชัดเจนสงวนไว้โดย 32BitZ Studio

source: Shinobi War is not intended for children under the minimum legal age required in your jurisdiction. We do not knowingly collect personal data from children.
ja: Shinobi Warは、お客様の管轄区域で要求される最低法定年齢未満の児童を対象としていません。当社は意図的に児童から個人データを収集することはありません。
km: Shinobi War មិនមានបំណងសម្រាប់កុមារដែលមានអាយុក្រោមអាយុច្បាប់អប្បបរមាដែលត្រូវបានទាមទារនៅក្នុងអំណាចរបស់អ្នកទេ។ យើងមិនប្រមូលទិន្នន័យផ្ទាល់ខ្លួនពីកុមារដោយដឹងខ្លួនទេ។
th: Shinobi War ไม่ได้มีไว้สำหรับเด็กที่อายุต่ำกว่าอายุตามกฎหมายขั้นต่ำที่กำหนดในเขตอำนาจของคุณ เราไม่เก็บรวบรวมข้อมูลส่วนบุคคลจากเด็กโดยเจตนา

source: Some data may be retained for legal or security reasons
ja: 一部のデータは法的またはセキュリティ上の理由により保持される場合があります
km: ទិន្នន័យមួយចំនួនអាចត្រូវបានរក្សាទុកសម្រាប់ហេតុផលផ្លូវច្បាប់ ឬសុវត្ថិភាព
th: ข้อมูลบางส่วนอาจถูกเก็บไว้เพื่อเหตุผลทางกฎหมายหรือความปลอดภัย

source: Support communications and reports
ja: サポート通信とレポート
km: ការទំនាក់ទំនង និងរាយការណ៍ការគាំទ្រ
th: การสื่อสารและการรายงานการสนับสนุน

source: Support hours
ja: サポート時間
km: ម៉ោងគាំទ្រ
th: เวลาสนับสนุน

source: Terms & Conditions
ja: 利用規約
km: លក្ខខណ្ឌ និងលក្ខខណ្ឌ
th: ข้อกำหนดและเงื่อนไข

source: These Terms are governed by the laws applicable in the jurisdiction where 32BitZ Studio operates.
ja: これらの規約は、32BitZ Studioが運営する管轄区域で適用される法律に準拠します。
km: លក្ខខណ្ឌទាំងនេះត្រូវបានគ្រប់គ្រងដោយច្បាប់ដែលអាចអនុវត្តបាននៅក្នុងអំណាចដែល 32BitZ Studio ដំណើរការ។
th: ข้อกำหนดเหล่านี้อยู่ภายใต้กฎหมายที่ใช้บังคับในเขตอำนาจที่ 32BitZ Studio ดำเนินการ

source: To the fullest extent permitted by law, 32BitZ Studio shall not be liable for indirect, incidental, or consequential damages.
ja: 法律で許可される最大限の範囲で、32BitZ Studioは間接的、偶発的、または結果的な損害について責任を負いません。
km: ក្នុងកម្រិតអតិបរមាដែលច្បាប់អនុញ្ញាត 32BitZ Studio នឹងមិនទទួលខុសត្រូវចំពោះការខូចខាតដោយប្រយោល ចៃដន្យ ឬជាលទ្ធផលទេ។
th: ในขอบเขตที่กฎหมายอนุญาต 32BitZ Studio จะไม่รับผิดชอบต่อความเสียหายทางอ้อม ตามบังเอิญ หรือตามผล

source: TOP UP
ja: チャージ
km: បន្ថែមទឹកប្រាក់
th: เติมเงิน

source: Unauthorized modifications will result in permanent bans.
ja: 不正な変更は永久BANの対象となります。
km: ការកែប្រែដោយគ្មានការអនុញ្ញាតនឹងនាំឱ្យមានការហាមឃាត់ជាអចិន្ត្រៃយ៍។
th: การแก้ไขโดยไม่ได้รับอนุญาตจะส่งผลให้ถูกแบนถาวร

source: Virtual assets are non-transferable and non-refundable.
ja: 仮想資産は譲渡不可で返金不可です。
km: ទ្រព្យសកម្មផ្លូវការមិនអាចផ្ទេរ និងមិនអាចសងប្រាក់បានទេ។
th: สินทรัพย์เสมือนไม่สามารถโอนและไม่สามารถคืนเงินได้

source: visual gallery
ja: ビジュアルギャラリー
km: វិចិត្រសាល
th: แกลเลอรีภาพ

source: Warning: Playing more than 180 minutes per day may negatively affect your health.
ja: 警告：1日180分以上プレイすると、健康に悪影響を与える可能性があります。
km: ការព្រមាន: ការលេងច្រើនជាង 180 នាទីក្នុងមួយថ្ងៃអាចប៉ះពាល់អវិជ្ជមានដល់សុខភាពរបស់អ្នក។
th: คำเตือน: การเล่นเกมมากกว่า 180 นาทีต่อวันอาจส่งผลกระทบต่อสุขภาพของคุณ

source: We do <0>not</0> sell or rent your personal data.
ja: 当社はお客様の個人データを<0>販売または賃貸しません</0>。
km: យើង<0>មិន</0>លក់ ឬជួលទិន្នន័យផ្ទាល់ខ្លួនរបស់អ្នកទេ។
th: เรา<0>ไม่</0>ขายหรือให้เช่าข้อมูลส่วนบุคคลของคุณ

source: We do not guarantee preservation of progress, data, rankings, or virtual assets. Data loss may occur due to updates, resets, or security actions.
ja: 進捗、データ、ランキング、または仮想資産の保存を保証するものではありません。更新、リセット、またはセキュリティ対策により、データ損失が発生する場合があります。
km: យើងមិនធានាការរក្សាទុកការវិវត្ត ទិន្នន័យ ចំណាត់ថ្នាក់ ឬទ្រព្យសកម្មផ្លូវការទេ។ ការបាត់បង់ទិន្នន័យអាចកើតឡើងដោយសារតែការអាប់ដេត ការកំណត់ឡើងវិញ ឬសកម្មភាពសុវត្ថិភាព។
th: เราไม่รับประกันการรักษาความคืบหน้า ข้อมูล อันดับ หรือสินทรัพย์เสมือน การสูญเสียข้อมูลอาจเกิดขึ้นเนื่องจากการอัปเดต การรีเซ็ต หรือการดำเนินการด้านความปลอดภัย

source: We grant you a limited, revocable, non-exclusive, non-transferable license to use the Game solely for personal, non-commercial purposes.
ja: 当社は、個人の非商業目的のみでゲームを使用するための、限定的、取消可能、非独占的、譲渡不可のライセンスを付与します。
km: យើងផ្តល់ឱ្យអ្នកនូវអាជ្ញាប័ណ្ណមានកំណត់ អាចលុបចោលបាន មិនផ្តាច់មុខ មិនអាចផ្ទេរបាន ដើម្បីប្រើប្រាស់ហ្គេមតែសម្រាប់គោលបំណងផ្ទាល់ខ្លួន និងមិនមែនពាណិជ្ជកម្មប៉ុណ្ណោះ។
th: เรามอบสิทธิ์ให้คุณใช้เกมแบบจำกัด ยกเลิกได้ ไม่ใช่สิทธิ์เฉพาะ และไม่สามารถโอนได้ เฉพาะเพื่อวัตถุประสงค์ส่วนตัวและไม่ใช่เชิงพาณิชย์เท่านั้น

source: We implement reasonable technical and organizational measures to protect your data. However, no system is 100% secure, and we cannot guarantee absolute security.
ja: 当社は、お客様のデータを保護するために合理的な技術的および組織的措置を実施しています。ただし、システムは100%安全ではなく、絶対的なセキュリティを保証することはできません。
km: យើងអនុវត្តវិធានការបច្ចេកទេស និងអង្គការដែលសមហេតុផលដើម្បីការពារទិន្នន័យរបស់អ្នក។ ទោះជាយ៉ាងណាក៏ដោយ គ្មានប្រព័ន្ធណាមួយមានសុវត្ថិភាព 100% ទេ ហើយយើងមិនអាចធានាសុវត្ថិភាពដាច់ខាតបានទេ។
th: เราดำเนินการมาตรการทางเทคนิคและองค์กรที่สมเหตุสมผลเพื่อปกป้องข้อมูลของคุณ อย่างไรก็ตาม ไม่มีระบบใดปลอดภัย 100% และเราไม่สามารถรับประกันความปลอดภัยที่สมบูรณ์ได้

source: We may collect the following categories of information:
ja: 当社は以下のカテゴリの情報を収集する場合があります：
km: យើងអាចប្រមូលព័ត៌មានក្នុងប្រភេទខាងក្រោម:
th: เราอาจรวบรวมข้อมูลในหมวดหมู่ต่อไปนี้:

source: We may share limited data with trusted third-party service providers strictly for operational purposes, such as:
ja: 当社は、運営目的のために、信頼できる第三者サービスプロバイダーと限定的なデータを共有する場合があります。例：
km: យើងអាចចែករំលែកទិន្នន័យមានកំណត់ជាមួយអ្នកផ្តល់សេវាភាគីទីបីដែលអាចទុកចិត្តបានតឹងរ៉ឹងសម្រាប់គោលបំណងប្រតិបត្តិការ ដូចជា:
th: เราอาจแบ่งปันข้อมูลจำกัดกับผู้ให้บริการบุคคลที่สามที่เชื่อถือได้อย่างเคร่งครัดเพื่อวัตถุประสงค์ในการดำเนินงาน เช่น:

source: We may suspend or terminate accounts without prior notice.
ja: 当社は事前通知なくアカウントを停止または終了する場合があります。
km: យើងអាចផ្អាក ឬបញ្ចប់គណនីដោយមិនចាំបាច់ជូនដំណឹងជាមុនទេ។
th: เราอาจระงับหรือยกเลิกบัญชีโดยไม่ต้องแจ้งล่วงหน้า

source: We may update this Privacy Policy at any time. Continued use of the Game constitutes acceptance of the updated Policy.
ja: 当社は、このプライバシーポリシーをいつでも更新する場合があります。ゲームの継続的な使用は、更新されたポリシーの受諾を構成します。
km: យើងអាចអាប់ដេតនយោបាយភាពឯកជននេះនៅពេលណាក៏បាន។ ការប្រើប្រាស់ហ្គេមបន្តគឺជាការទទួលយកនយោបាយដែលបានអាប់ដេត។
th: เราอาจอัปเดตนโยบายความเป็นส่วนตัวนี้ได้ตลอดเวลา การใช้เกมต่อไปถือเป็นการยอมรับนโยบายที่อัปเดตแล้ว

source: We process personal data based on one or more of the following:
ja: 当社は、以下の1つ以上に基づいて個人データを処理します：
km: យើងដំណើរការទិន្នន័យផ្ទាល់ខ្លួនដោយផ្អែកលើមួយ ឬច្រើនពីខាងក្រោម:
th: เราประมวลผลข้อมูลส่วนบุคคลตามหนึ่งข้อหรือมากกว่าจากต่อไปนี้:

source: We reserve the right to modify, update, suspend, or discontinue any part of the Game at any time without liability.
ja: 当社は、責任を負うことなく、いつでもゲームの任意の部分を変更、更新、一時停止、または中止する権利を留保します。
km: យើងរក្សាសិទ្ធិក្នុងការកែប្រែ អាប់ដេត ផ្អាក ឬបញ្ឈប់ផ្នែកណាមួយនៃហ្គេមនៅពេលណាក៏បានដោយគ្មានការទទួលខុសត្រូវ។
th: เราสงวนสิทธิ์ในการแก้ไข อัปเดต ระงับ หรือหยุดส่วนใดส่วนหนึ่งของเกมได้ตลอดเวลาโดยไม่ต้องรับผิดชอบ

source: We retain personal data only for as long as necessary to fulfill the purposes outlined in this Policy, unless a longer retention period is required by law.
ja: 当社は、法律でより長い保持期間が要求されない限り、このポリシーに記載されている目的を達成するために必要な期間のみ個人データを保持します。
km: យើងរក្សាទុកទិន្នន័យផ្ទាល់ខ្លួនតែរយៈពេលដែលចាំបាច់ដើម្បីបំពេញគោលបំណងដែលបានពិពណ៌នានៅក្នុងនយោបាយនេះ លើកលែងតែរយៈពេលរក្សាទុកយូរជាងនេះត្រូវបានទាមទារដោយច្បាប់។
th: เราเก็บรักษาข้อมูลส่วนบุคคลเฉพาะเท่าที่จำเป็นเพื่อบรรลุวัตถุประสงค์ที่ระบุไว้ในนโยบายนี้ เว้นแต่กฎหมายจะกำหนดระยะเวลาการเก็บรักษาที่ยาวนานกว่า

source: Withdraw consent where applicable
ja: 該当する場合、同意の撤回
km: ដកយកការយល់ព្រមនៅកន្លែងដែលអាចអនុវត្តបាន
th: ถอนความยินยอมในกรณีที่ใช้ได้

source: Written by
ja: 執筆者
km: សរសេរដោយ
th: เขียนโดย

source: You are responsible for all activity under your account.
ja: お客様は、お客様のアカウント下のすべての活動に責任を負います。
km: អ្នកទទួលខុសត្រូវចំពោះសកម្មភាពទាំងអស់នៅក្រោមគណនីរបស់អ្នក។
th: คุณมีหน้าที่รับผิดชอบต่อกิจกรรมทั้งหมดภายใต้บัญชีของคุณ

source: You are solely responsible for compliance with local laws.
ja: お客様は、現地法の遵守について単独で責任を負います。
km: អ្នកទទួលខុសត្រូវតែមួយគត់ចំពោះការអនុវត្តតាមច្បាប់ក្នុងស្រុក។
th: คุณมีหน้าที่รับผิดชอบเพียงผู้เดียวในการปฏิบัติตามกฎหมายท้องถิ่น

source: You must have full legal capacity to enter into a binding agreement.
ja: お客様は、拘束力のある契約を締結するための完全な法的能力を持っている必要があります。
km: អ្នកត្រូវតែមានសមត្ថភាពផ្លូវច្បាប់ពេញលេញដើម្បីចូលកិច្ចសន្យាដែលមានភាពចងភ្ជាប់។
th: คุณต้องมีความสามารถทางกฎหมายเต็มที่ในการเข้าสู่ข้อตกลงที่มีผลผูกพัน

source: You must meet the minimum age requirement in your jurisdiction.
ja: お客様は、お客様の管轄区域の最低年齢要件を満たしている必要があります。
km: អ្នកត្រូវតែបំពេញតម្រូវការអាយុអប្បបរមានៅក្នុងអំណាចរបស់អ្នក។
th: คุณต้องเป็นไปตามข้อกำหนดอายุขั้นต่ำในเขตอำนาจของคุณ

source: Your consent
ja: お客様の同意
km: ការយល់ព្រមរបស់អ្នក
th: ความยินยอมของคุณ

source: Your data may be processed or stored on servers located outside your country. By using the Game, you consent to such transfers.
ja: お客様のデータは、お客様の国以外のサーバーで処理または保存される場合があります。ゲームを使用することにより、お客様はそのような転送に同意したことになります。
km: ទិន្នន័យរបស់អ្នកអាចត្រូវបានដំណើរការ ឬរក្សាទុកនៅលើម៉ាស៊ីនមេដែលស្ថិតនៅក្រៅប្រទេសរបស់អ្នក។ ដោយការប្រើប្រាស់ហ្គេម អ្នកយល់ព្រមនឹងការផ្ទេរបែបនេះ។
th: ข้อมูลของคุณอาจถูกประมวลผลหรือเก็บไว้บนเซิร์ฟเวอร์ที่ตั้งอยู่นอกประเทศของคุณ โดยการใช้เกม คุณยินยอมให้มีการถ่ายโอนดังกล่าว
